ARMmbed/mbed-os/targets/TARGET_Geehy/TARGET_APM32F4XX/APM32F4xx_StdPeriphDriver/src/apm32f4xx_usb.c
    return ((temp & (uint32_t)(interrupt)) ? SET : RESET);
}

/*!
 * @brief     Clear channel interrrupt status
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum: channel number
 *
 * @param     interrrupt: channel interrrupt
 *              @arg CHANNEL_INT_TSFCMPN
 *
 * @retval    None
 */
void USB_OTG_H_ClearChannelIntFlag(USB_OTG_HOST_T* usbhx, uint8_t chNum, uint32_t interrupt)
{
    usbhx->REGS_HCH[chNum].HCHINT = (interrupt);
}

/*!
 * @brief     Clear all channel interrrupt status
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum: channel number
 *
 * @retval    None
 */
void USB_OTG_H_ClearAllChannelIntFlag(USB_OTG_HOST_T* usbhx, uint8_t chNum)
{
    usbhx->REGS_HCH[chNum].HCHINT = 0xFFFFFFFF;
    usbhx->REGS_HCH[chNum].HCHIMASK = 0;
}

/*!
 * @brief     Read port connect status
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    Port connect status
 */
uint8_t USB_OTG_H_ReadPortConnectIntTriFlag(USB_OTG_HOST_T* usbhx)
{
    return (usbhx->HPORTCSTS_B.PCINTFLG);
}

/*!
 * @brief     Clear port connect status
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    None
 */
void USB_OTG_H_ClearPortConnectIntTriFlag(USB_OTG_HOST_T* usbhx)
{
    usbhx->HPORTCSTS_B.PCINTFLG = BIT_SET;
}

/*!
 * @brief     Configure and activate endpoint
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     ep: endpoint structure
 *
 * @retval    None
 */
void USB_OTG_D_ConfigEP(USB_OTG_DEVICE_T* usbdx, USB_OTG_ENDPOINT_INFO_T* ep)
{
    if (ep->epDir)
    {
        usbdx->DAEPIMASK_B.AINM  |= (0x0001 << ep->epNum);

        if (usbdx->EP_IN[ep->epNum].DIEPCTRL_B.USBAEP == BIT_RESET)
        {
            usbdx->EP_IN[ep->epNum].DIEPCTRL_B.MAXPS    = ep->mps;
            usbdx->EP_IN[ep->epNum].DIEPCTRL_B.EPTYPE   = ep->epType;
            usbdx->EP_IN[ep->epNum].DIEPCTRL_B.TXFNUM   = ep->epNum;
            usbdx->EP_IN[ep->epNum].DIEPCTRL_B.DPIDSET  = BIT_SET;
            usbdx->EP_IN[ep->epNum].DIEPCTRL_B.USBAEP   = BIT_SET;
        }
    }
    else
    {
        usbdx->DAEPIMASK_B.AOUTM  |= (0x0001 << ep->epNum);

        if (usbdx->EP_OUT[ep->epNum].DOEPCTRL_B.USBAEP == BIT_RESET)
        {
            usbdx->EP_OUT[ep->epNum].DOEPCTRL_B.MAXPS    = ep->mps;
            usbdx->EP_OUT[ep->epNum].DOEPCTRL_B.EPTYPE   = ep->epType;
            usbdx->EP_OUT[ep->epNum].DOEPCTRL_B.DPIDSET  = BIT_SET;
            usbdx->EP_OUT[ep->epNum].DOEPCTRL_B.USBAEP   = BIT_SET;
        }

    }
}

/*!
 * @brief     Reset and de-activate endpoint
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     ep: endpoint structure
 *
 * @retval    None
 */
void USB_OTG_D_ResetEP(USB_OTG_DEVICE_T* usbdx, USB_OTG_ENDPOINT_INFO_T* ep)
{
    if (ep->epDir)
    {
        if (usbdx->EP_IN[ep->epNum].DIEPCTRL_B.EPEN == BIT_SET)
        {
            usbdx->EP_IN[ep->epNum].DIEPCTRL_B.EPDIS = BIT_SET;
            usbdx->EP_IN[ep->epNum].DIEPCTRL_B.NAKSET = BIT_SET;
        }

        usbdx->DAEPIMASK_B.AINM  &= ~(0x0001 << ep->epNum);
        usbdx->DEPIMASK_B.IN1M &= ~(0x0001 << ep->epNum);

        usbdx->EP_IN[ep->epNum].DIEPCTRL_B.MAXPS = BIT_RESET;
        usbdx->EP_IN[ep->epNum].DIEPCTRL_B.USBAEP = BIT_RESET;
        usbdx->EP_IN[ep->epNum].DIEPCTRL_B.TXFNUM = BIT_RESET;
        usbdx->EP_IN[ep->epNum].DIEPCTRL_B.EPTYPE = BIT_RESET;
        usbdx->EP_IN[ep->epNum].DIEPCTRL_B.DPIDSET = BIT_RESET;
    }
    else
    {
        if (usbdx->EP_OUT[ep->epNum].DOEPCTRL_B.EPEN == BIT_SET)
        {
            usbdx->EP_OUT[ep->epNum].DOEPCTRL_B.EPDIS = BIT_SET;
            usbdx->EP_OUT[ep->epNum].DOEPCTRL_B.NAKSET = BIT_SET;
        }

        usbdx->DAEPIMASK_B.AOUTM  &= ~(0x0001 << ep->epNum);
        usbdx->DEPIMASK_B.OUT1M &= ~(0x0001 << ep->epNum);

        usbdx->EP_OUT[ep->epNum].DOEPCTRL_B.MAXPS = BIT_RESET;
        usbdx->EP_OUT[ep->epNum].DOEPCTRL_B.USBAEP = BIT_RESET;
        usbdx->EP_OUT[ep->epNum].DOEPCTRL_B.EPTYPE = BIT_RESET;
        usbdx->EP_OUT[ep->epNum].DOEPCTRL_B.DPIDSET = BIT_RESET;
    }
}

/*!
 * @brief     Configure soft disconnect status
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     status: Select the soft disconnect status
 *              @arg USBD_SOFT_DISC_NORMAL
 *              @arg USBD_SOFT_DISC_ENABLE
 *
 * @retval    None
 */
void USB_OTG_D_ConfigSoftDisconnect(USB_OTG_DEVICE_T* usbdx, USBD_SOFT_DISC_T status)
{
    if (status == USBD_SOFT_DISC_ENABLE)
    {
        usbdx->DCTRL_B.SDCNNT = BIT_SET;
    }
    else
    {
        usbdx->DCTRL_B.SDCNNT = BIT_RESET;
    }
}

/*!
 * @brief     Configure periodic frame interval
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     interval: Frame interval
 *              @arg USBD_FRAME_INTERVAL_80
 *              @arg USBD_FRAME_INTERVAL_85
 *              @arg USBD_FRAME_INTERVAL_90
 *              @arg USBD_FRAME_INTERVAL_95
 *
 * @retval    None
 */
void USB_OTG_D_ConfigPeriodicFrameInterval(USB_OTG_DEVICE_T* usbdx, USBD_FRAME_INTERVAL_T interval)
{
    usbdx->DCFG_B.PFITV = interval;
}

/*!
 * @brief     Configure device speed
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     speed: device speed
 *              @arg USBD_DEV_SPEED_HS
 *              @arg USBD_DEV_SPEED_HS_IN_FS
 *              @arg USBD_DEV_SPEED_FS
 *
 * @retval    None
 */
void USB_OTG_D_ConfigDeviceSpeed(USB_OTG_DEVICE_T* usbdx, USBD_DEV_SPEED_T speed)
{
    usbdx->DCFG_B.DSPDSEL = speed;
}

/*!
 * @brief     Read enum speed
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @retval    None
 */
uint8_t USB_OTG_D_ReadEnumSpeed(USB_OTG_DEVICE_T* usbdx)
{
    return usbdx->DSTS_B.ENUMSPD;
}

/*!
 * @brief     Configure device address
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     address: device address
 *
 * @retval    None
 */
void USB_OTG_D_ConfigDeviceAddress(USB_OTG_DEVICE_T* usbdx, uint8_t address)
{
    usbdx->DCFG_B.DADDR = address;
}

/*!
 * @brief     Enable USB Remote Wakeup.
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @retval    None
 */
void USB_OTG_D_EnableRemoteWakeupSignal(USB_OTG_DEVICE_T* usbdx)
{
    usbdx->DCTRL_B.RWKUPS = BIT_SET;
}

/*!
 * @brief     Disable USB Remote Wakeup.
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @retval    None
 */
void USB_OTG_D_DisableRemoteWakeupSignal(USB_OTG_DEVICE_T* usbdx)
{
    usbdx->DCTRL_B.RWKUPS = BIT_RESET;
}

/*!
 * @brief     Enable OUT endpoint the whole interrupt mask
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     epNum: Endpoint number
 *              @arg USBD_EP_0
 *              @arg USBD_EP_1
 *              @arg USBD_EP_2
 *              @arg USBD_EP_3
 *              @arg USBD_EP_4
 *              @arg USBD_EP_5
 *              @arg USBD_EP_6
 *              @arg USBD_EP_7
 *
 * @retval    None
 */
void USB_OTG_D_EnableOutEpInterruptMask(USB_OTG_DEVICE_T* usbdx, uint8_t epNum)
{
    usbdx->DAEPIMASK_B.AOUTM |= (0x0001 << epNum);
}

/*!
 * @brief     Disable OUT endpoint the whole interrupt mask
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     epNum: Endpoint number
 *              @arg USBD_EP_0
 *              @arg USBD_EP_1
 *              @arg USBD_EP_2
 *              @arg USBD_EP_3
 *              @arg USBD_EP_4
 *              @arg USBD_EP_5
 *              @arg USBD_EP_6
 *              @arg USBD_EP_7
 *
 * @retval    None
 */
void USB_OTG_D_DisableOutEpInterruptMask(USB_OTG_DEVICE_T* usbdx, uint8_t epNum)
{
    usbdx->DAEPIMASK_B.AOUTM &= ~(0x0001 << epNum);
}

/*!
 * @brief     Enable IN endpoint the whole interrupt mask
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     epNum: Endpoint number
 *              @arg USBD_EP_0
 *              @arg USBD_EP_1
 *              @arg USBD_EP_2
 *              @arg USBD_EP_3
 *              @arg USBD_EP_4
 *              @arg USBD_EP_5
 *              @arg USBD_EP_6
 *              @arg USBD_EP_7
 *
 * @retval    None
 */
void USB_OTG_D_EnableInEpInterruptMask(USB_OTG_DEVICE_T* usbdx, uint8_t epNum)
{
    usbdx->DAEPIMASK_B.AINM |= (0x0001 << epNum);
}

/*!
 * @brief     Disable IN endpoint the whole interrupt mask
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     epNum: Endpoint number
 *              @arg USBD_EP_0
 *              @arg USBD_EP_1
 *              @arg USBD_EP_2
 *              @arg USBD_EP_3
 *              @arg USBD_EP_4
 *              @arg USBD_EP_5
 *              @arg USBD_EP_6
 *              @arg USBD_EP_7
 *
 * @retval    None
 */
void USB_OTG_D_DisableInEpInterruptMask(USB_OTG_DEVICE_T* usbdx, uint8_t epNum)
{
    usbdx->DAEPIMASK_B.AINM &= ~(0x0001 << epNum);
}

/*!
 * @brief     Enable IN endpoint empty interrupt
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     epNum: endpoint number
 *
 * @retval    None
 */
void USB_OTG_D_EnableInEpEmptyInterrupt(USB_OTG_DEVICE_T* usbdx, uint8_t epNum)
{
    usbdx->DIEIMASK |= ((uint32_t)(1 << epNum));
}

/*!
 * @brief     Disable IN endpoint empty interrupt
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     epNum: endpoint number
 *
 * @retval    None
 */
void USB_OTG_D_DisableInEpEmptyInterrupt(USB_OTG_DEVICE_T* usbdx, uint8_t epNum)
{
    usbdx->DIEIMASK &= ~((uint32_t)(1 << epNum));
}

/*!
 * @brief     Disable all in endpoint interrupt
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @retval    None
 */
void USB_OTG_D_DisableAllInEpInterrupt(USB_OTG_DEVICE_T* usbdx)
{
    usbdx->DINIMASK = 0x0;
}

/*!
 * @brief     Disable all out endpoint interrupt
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @retval    None
 */
void USB_OTG_D_DisableAllOutEpInterrupt(USB_OTG_DEVICE_T* usbdx)
{
    usbdx->DOUTIMASK = 0x0;
}

/*!
 * @brief     Disable all endpoint interrupt
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @retval    None
 */
void USB_OTG_D_DisableAllEpInterrupt(USB_OTG_DEVICE_T* usbdx)
{
    usbdx->DAEPIMASK = 0x0;
}

/*!
 * @brief     Enable IN endpoint 1 interrupt
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     interrupt: IN endpoint 1 interrupt
 *              @arg USBD_INT_EP_IN_TSFCMP
 *              @arg USBD_INT_EP_IN_EPDIS
 *              @arg USBD_INT_EP_IN_TO
 *              @arg USBD_INT_EP_IN_ITXEMP
 *              @arg USBD_INT_EP_IN_IEPMM
 *              @arg USBD_INT_EP_IN_IEPNAKE
 *              @arg USBD_INT_EP_IN_TXFUDR
 *              @arg USBD_INT_EP_IN_BNA
 *
 * @retval    None
 */
void USB_OTG_D_EnableInEp1Interrupt(USB_OTG_DEVICE_T* usbdx, uint32_t interrupt)
{
    usbdx->DIN1IMASK |= interrupt;
}

/*!
 * @brief     Disble IN endpoint 1 interrupt
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     interrupt: IN endpoint 1 interrupt
 *              @arg USBD_INT_EP_IN_TSFCMP
 *              @arg USBD_INT_EP_IN_EPDIS
 *              @arg USBD_INT_EP_IN_TO
 *              @arg USBD_INT_EP_IN_ITXEMP
 *              @arg USBD_INT_EP_IN_IEPMM
 *              @arg USBD_INT_EP_IN_IEPNAKE
 *              @arg USBD_INT_EP_IN_TXFUDR
 *              @arg USBD_INT_EP_IN_BNA
 *
 * @retval    None
 */
void USB_OTG_D_DisableInEp1Interrupt(USB_OTG_DEVICE_T* usbdx, uint32_t interrupt)
{
    usbdx->DIN1IMASK &= ~interrupt;
}

/*!
 * @brief     Enable OUT endpoint 1 interrupt
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     interrupt: OUT endpoint 1 interrupt
 *              @arg USBD_INT_EP_OUT_TSFCMP
 *              @arg USBD_INT_EP_OUT_EPDIS
 *              @arg USBD_INT_EP_OUT_AHBERR
 *              @arg USBD_INT_EP_OUT_OPERR
 *              @arg USBD_INT_EP_OUT_BNA
 *              @arg USBD_INT_EP_OUT_BERR
 *              @arg USBD_INT_EP_OUT_NAK
 *              @arg USBD_INT_EP_OUT_NYET
 *
 * @retval    None
 */
void USB_OTG_D_EnableOutEp1Interrupt(USB_OTG_DEVICE_T* usbdx, uint32_t interrupt)
{
    usbdx->DOUT1MASK |= interrupt;
}

/*!
 * @brief     Disable OUT endpoint 1 interrupt
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     interrupt: OUT endpoint 1 interrupt
 *              @arg USBD_INT_EP_OUT_TSFCMP
 *              @arg USBD_INT_EP_OUT_EPDIS
 *              @arg USBD_INT_EP_OUT_AHBERR
 *              @arg USBD_INT_EP_OUT_OPERR
 *              @arg USBD_INT_EP_OUT_BNA
 *              @arg USBD_INT_EP_OUT_BERR
 *              @arg USBD_INT_EP_OUT_NAK
 *              @arg USBD_INT_EP_OUT_NYET
 *
 * @retval    None
 */
void USB_OTG_D_DisbleOutEp1Interrupt(USB_OTG_DEVICE_T* usbdx, uint32_t interrupt)
{
    usbdx->DOUT1MASK &= ~interrupt;
}

/*!
 * @brief     Enable IN endpoint interrupt
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     interrupt: IN endpoint interrupt
 *              @arg USBD_INT_EP_IN_TSFCMP
 *              @arg USBD_INT_EP_IN_EPDIS
 *              @arg USBD_INT_EP_IN_TO
 *              @arg USBD_INT_EP_IN_ITXEMP
 *              @arg USBD_INT_EP_IN_IEPMM
 *              @arg USBD_INT_EP_IN_IEPNAKE
 *              @arg USBD_INT_EP_IN_TXFUDR
 *              @arg USBD_INT_EP_IN_BNA
 *
 * @retval    None
 */
void USB_OTG_D_EnableInEpInterrupt(USB_OTG_DEVICE_T* usbdx, uint32_t interrupt)
{
    usbdx->DINIMASK |= interrupt;
}

/*!
 * @brief     Disable IN endpoint interrupt
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     interrupt: IN endpoint interrupt
 *              @arg USBD_INT_EP_IN_TSFCMP
 *              @arg USBD_INT_EP_IN_EPDIS
 *              @arg USBD_INT_EP_IN_TO
 *              @arg USBD_INT_EP_IN_ITXEMP
 *              @arg USBD_INT_EP_IN_IEPMM
 *              @arg USBD_INT_EP_IN_IEPNAKE
 *              @arg USBD_INT_EP_IN_TXFUDR
 *              @arg USBD_INT_EP_IN_BNA
 *
 * @retval    None
 */
void USB_OTG_D_DisableInEpInterrupt(USB_OTG_DEVICE_T* usbdx, uint32_t interrupt)
{
    usbdx->DINIMASK &= ~interrupt;
}

/*!
 * @brief     Enable OUT endpoint interrupt
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     interrupt: OUT endpoint interrupt
 *                  @arg USBD_INT_EP_OUT_TSFCMP : Transfer completed.
 *                  @arg USBD_INT_EP_OUT_EPDIS  : Endpoint disabled.
 *                  @arg USBD_INT_EP_OUT_SETPCMP: setup completed.
 *                  @arg USBD_INT_EP_OUT_RXOTDIS: OUT token received when endpoint disabled.
 *                  @arg USBD_INT_EP_OUT_RXBSP  : Received Back-to-back SETUP packets over 3.
 *                  @arg USBD_INT_EP_OUT_ALL    : all interrupt above.
 *
 * @retval    None
 */
void USB_OTG_D_EnableOutEpInterrupt(USB_OTG_DEVICE_T* usbdx, uint32_t interrupt)
{
    usbdx->DOUTIMASK |= interrupt;
}

/*!
 * @brief     Disable OUT endpoint interrupt
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     interrupt: OUT endpoint interrupt
 *                  @arg USBD_INT_EP_OUT_TSFCMP : Transfer completed.
 *                  @arg USBD_INT_EP_OUT_EPDIS  : Endpoint disabled.
 *                  @arg USBD_INT_EP_OUT_SETPCMP: setup completed.
 *                  @arg USBD_INT_EP_OUT_RXOTDIS: OUT token received when endpoint disabled.
 *                  @arg USBD_INT_EP_OUT_RXBSP  : Received Back-to-back SETUP packets over 3.
 *                  @arg USBD_INT_EP_OUT_ALL    : all interrupt above.
 *
 * @retval    None
 */
void USB_OTG_D_DisableOutEpInterrupt(USB_OTG_DEVICE_T* usbdx, uint32_t interrupt)
{
    usbdx->DOUTIMASK &= ~interrupt;
}

/*!
 * @brief     Read all OUT endpoint interrupt number
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @retval    OUT endpoint interrupt number
 */
uint16_t USB_OTG_D_ReadAllOutEpIntNumber(USB_OTG_DEVICE_T* usbdx)
{
    uint16_t temp;

    temp = usbdx->DAEPINT_B.OUTEPINT;
    temp &= usbdx->DAEPIMASK_B.AOUTM;

    return temp;
}

/*!
 * @brief     Read all IN endpoint interrupt number
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @retval    INT endpoint interrupt number
 */
uint16_t USB_OTG_D_ReadAllInEpIntNumber(USB_OTG_DEVICE_T* usbdx)
{
    uint16_t temp;

