ARMmbed/mbed-os/targets/TARGET_Geehy/TARGET_APM32F4XX/APM32F4xx_StdPeriphDriver/src/apm32f4xx_usb.c
    temp = usbdx->DAEPINT_B.INEPINT;
    temp &= usbdx->DAEPIMASK_B.AINM;

    return temp;
}

/*!
 * @brief     Read the OUT endpoint interrupt status
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     epNum : OUT endpiont number
 *
 * @param     interrupt : OUT ep interrupt flag.
 *                     This parameter can be one of the following value:
 *                     @arg USBD_INT_EP_OUT_TSFCMP : Transfer completed
 *                     @arg USBD_INT_EP_OUT_EPDIS  : Endpoint disabled
 *                     @arg USBD_INT_EP_OUT_SETPCMP: setup completed
 *                     @arg USBD_INT_EP_OUT_RXOTDIS: OUT token received when endpoint disabled
 *                     @arg USBD_INT_EP_OUT_RXBSP  : Received Back-to-back SETUP packets over 3
 *
 * @retval    OUT endpoint interrupt status
 */
uint8_t USB_OTG_D_ReadOutEpIntStatus(USB_OTG_DEVICE_T* usbdx, uint8_t epNum, uint32_t interrupt)
{
    uint8_t status = RESET;

    if ((((uint8_t)usbdx->EP_OUT[epNum].DOEPINT) & interrupt) != RESET)
    {
        status = SET;
    }
    else
    {
        status = RESET;
    }

    return status;
}

/*!
 * @brief     Read the IN endpoint interrupt status
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     epNum : IN endpiont number
 *
 * @param     interrupt : IN ep interrupt flag.
 *                     This parameter can be one of the following value:
 *                     @arg USBD_INT_EP_IN_TSFCMP : Transfer completed
 *                     @arg USBD_INT_EP_IN_EPDIS  : Endpoint disabled
 *                     @arg USBD_INT_EP_IN_TO     : Timeout
 *                     @arg USBD_INT_EP_IN_ITXEMP : IN token received when TxFIFO is empty
 *                     @arg USBD_INT_EP_IN_IEPNAKE: IN endpoint NAK effective
 *                     @arg USBD_INT_EP_IN_TXFE   : TxFIFO empty
 *
 * @retval    IN endpoint interrupt status
 */
uint8_t USB_OTG_D_ReadInEpIntStatus(USB_OTG_DEVICE_T* usbdx, uint8_t epNum, uint32_t interrupt)
{
    return (((uint8_t)usbdx->EP_IN[epNum].DIEPINT) & interrupt) ? SET : RESET;
}

/*!
 * @brief     Clear the OUT endpoint interrupt status
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     epNum : OUT endpiont number
 *
 * @param     interrupt: OUT ep interrupt flag.
 *                  This parameter can be any combination of the following value:
 *                  @arg USBD_INT_EP_OUT_TSFCMP : Transfer completed.
 *                  @arg USBD_INT_EP_OUT_EPDIS  : Endpoint disabled.
 *                  @arg USBD_INT_EP_OUT_SETPCMP: setup completed.
 *                  @arg USBD_INT_EP_OUT_RXOTDIS: OUT token received when endpoint disabled.
 *                  @arg USBD_INT_EP_OUT_RXBSP  : Received Back-to-back SETUP packets over 3.
 *                  @arg USBD_INT_EP_OUT_ALL    : all interrupt above.
 *
 * @retval    OUT endpoint interrupt status
 */
void USB_OTG_D_ClearOutEpIntStatus(USB_OTG_DEVICE_T* usbdx, uint8_t epNum, uint32_t interrupt)
{
    usbdx->EP_OUT[epNum].DOEPINT |= interrupt;
}

/*!
 * @brief     Clear the IN endpoint interrupt status
 *
 * @param     usbdx: Select the USB device port.
 *              @arg USB_OTG_FS_D
 *              @arg USB_OTG_HS_D
 *
 * @param     epNum : IN endpiont number
 *
 * @param     interrupt: IN ep interrupt flag.
 *                  This parameter can be any combination of the following value:
 *                   @arg USBD_INT_EP_IN_TSFCMP  : Transfer completed.
 *                   @arg USBD_INT_EP_IN_EPDIS   : Endpoint disabled.
 *                   @arg USBD_INT_EP_IN_TO      : Timeout.
 *                   @arg USBD_INT_EP_IN_ITXEMP  : IN token received when TxFIFO is empty.
 *                   @arg USBD_INT_EP_IN_IEPNAKE : IN endpoint NAK effective.
 *                   @arg USBD_INT_EP_IN_TXFE    : TxFIFO empty.
 *                   @arg USBD_INT_EP_IN_ALL     : all interrupt above.
 *
 * @retval    IN endpoint interrupt status
 */
void USB_OTG_D_ClearInEpIntStatus(USB_OTG_DEVICE_T* usbdx, uint8_t epNum, uint32_t interrupt)
{
    usbdx->EP_IN[epNum].DIEPINT |= interrupt;
}

/*!
 * @brief       Write a buffer of data to a selected endpoint
 *
 * @param       usbFifo
 *
 * @param       chEpNum:  channel endpoint number
 *
 * @param       wBuf:   The pointer to the buffer of data to be written to the endpoint
 *
 * @param       wLen:   Number of data to be written (in bytes)
 *
 * @param       dmaStatus: DMA enable status
 *
 * @retval      None
 */
void USB_OTG_FIFO_WriteFifoPacket(USB_OTG_FIFO_T* usbFifo, uint8_t chEpNum, uint8_t* wBuf, uint32_t wlen, uint8_t dmaStatus)
{
    uint32_t wordCnt = 0, i = 0;

    if (dmaStatus == DISABLE)
    {
        wordCnt = (wlen + 3) / 4;

        for (i = 0; i < wordCnt; i++)
        {
            usbFifo->FIFO[chEpNum].DATA = (((const struct USB_FIFO_PACKET_T*)(const void*)(wBuf))->val);
            wBuf += 4;
        }
    }
}

/*!
 * @brief       Read the RxFIFO packet to buffer
 *
 * @param       usbFifo
 *
 * @param       rBuf:    Buffer pointer
 *
 * @param       rLen:    Buffer length
 *
 * @retval      None
 */
void USB_OTG_FIFO_ReadRxFifoPacket(USB_OTG_FIFO_T* usbFifo, uint8_t* rBuf, uint32_t rLen)
{
    uint32_t i = 0;
    uint32_t temp = 0;

    for (i = 0; i < rLen / 4; i++)
    {
        (((struct USB_FIFO_PACKET_T*)(void*)(rBuf))->val) = usbFifo->FIFO[0].DATA;
        rBuf += 4 ;
    }

    if (rLen & 0x3)
    {
        temp = usbFifo->FIFO[0].DATA;
        for (i = 0; i < (rLen & 0x3); i++)
        {
            rBuf[i] = temp >> (i << 3);
        }
    }
}

/**@} end of group USB_Functions*/
/**@} end of group USB_Driver*/
/**@} end of group APM32F4xx_StdPeriphDriver*/
